export const roomList: {
  name: string;
  work: [string, number][];
}[] = [
  {
    name: 'ห้องรับสิ่งส่งตรวจ',
    work: [['รับสิ่งส่งตรวจลงทะเบียนสิ่งส่งตรวจ', 130]],
  },
  {
    name: 'ห้องตรวจชิ้นเนื้อทางพยาธิวิทยา',
    work: [['ตรวจชิ้นเนื้อด้วยตาเปล่าทางพยาธิวิทยา', 150]],
  },
  {
    name: 'ห้องจุลพยาธิวิทยาพื้นฐาน',
    work: [
      ['Embed เนื้อเช้า', 150],
      ['Section เนื้อเช้า', 150],
      ['Embed และ Section', 150],
      ['Embed, Section และเปลี่ยนน้ำยา', 150],
      ['Embed, Section และเก็บเนื้อ process', 150],
      ['Embed, Section และตรวจสอบคุณภาพสไลด์', 150],
      ['เก็บเนื้อ process', 150],
      ['พนักงานห้องทดลอง', 110],
    ],
  },
  {
    name: 'ห้องเก็บบล็อกสไลด์',
    work: [['ห้องเก็บบล็อกสไลด์', 150]],
  },
  {
    name: 'งาน additional',
    work: [['งาน additional', 150]],
  },
  {
    name: 'ห้องฮีสโตเคมี',
    work: [
      ['เตรียมสไลด์ย้อมพิเศษ', 150],
      ['เตรียมสไลด์ย้อมพิเศษ และทำ frozen', 150],
      ['ตัดสไลด์ additional', 150],
      ['ย้อมสไลด์ special stain', 150],
      ['ย้อมสไลด์ special stain และล้างเซตน้ำยา', 150],
    ],
  },
  {
    name: 'ห้องอิมมูโนพยาธิวิทยา',
    work: [['ย้อมสไลด์ immuno stain', 150]],
  },
  {
    name: 'ห้องอณูพยาธิวิทยา',
    work: [['ห้องอณูพยาธิวิทยา', 150]],
  },
  {
    name: 'ห้องเซลล์วิทยา',
    work: [['จัดการสิ่งส่งตรวจทางเซลล์วิทยา', 150]],
  },
  {
    name: 'ห้องรายงานผล',
    work: [
      ['พิมพ์รายงานผล', 60],
      ['พิมพ์รายงานผล และคิดราคาย้อมเพิ่ม', 110],
    ],
  },
  {
    name: 'หน่วยดิจิทัล และการจัดการข้อมูล',
    work: [['สแกนไลด์', 130]],
  },
  {
    name: 'ห้องตรวจกล้ามเนื้อและเส้นประสาท',
    work: [['ห้องตรวจกล้ามเนื้อและเส้นประสาท', 150]],
  },
  {
    name: 'ห้องโฟลไซโตเมทรี',
    work: [['ห้องโฟลไซโตเมทรี', 150]],
  },
  {
    name: 'ห้องจุลทรรศน์อิเล็กตรอน',
    work: [['ห้องจุลทรรศน์อิเล็กตรอน', 150]],
  },
  {
    name: 'ห้องศพ',
    work: [['ห้องศพ', 60]],
  },
  {
    name: 'เจ้าหน้าที่ธุรการ',
    work: [['เจ้าหน้าที่ธุรการ', 60]],
  },
  {
    name: 'AI',
    work: [['AI', 60]],
  },
  {
    name: 'คนงาน',
    work: [['คนงาน', 60]],
  },
  {
    name: 'โสตฯ',
    work: [['โสตฯ', 60]],
  },
]

export const personPerRoom = {
  weekday: [1, 2, 8, 0, 0, 2, 1, 1, 0, 5, 0, 1, 0, 2, 2, 1, 1, 1, 1],
  weekend: [1, 3, 9, 2, 1, 3, 3, 1, 4, 2, 2, 2, 1, 1, 3, 3, 1, 2, 0],
}
