export const roomList = [
  {
    name: 'ห้องรับเนื้อ',
    work: [
      'รับสิ่งส่งตรวจลงทะเบียนสิ่งส่งตรวจ',
      'รับสิ่งส่งตรวจคลินิกและคลินิกพิเศษ',
    ],
  },
  {
    name: 'ห้อง Grossing',
    work: ['ตรวจชิ้นเนื้อด้วยตาเปล่าทางพยาธิวิทยา'],
  },
  {
    name: 'ห้องจุลพยาธิพื้นฐาน / ห้อง Routine',
    work: [
      'Embed เช้า',
      'Section เช้า',
      'Embed/ตัด H/E',
      'Embed/ตัด H/E เปลี่ยนน้ำยา',
      'H/E+ลงเครื่อง process',
      'ตัด H/E / QC',
      'เสริม (Embed/ตัด H/E)',
      'พนงห้องทดลอง',
    ],
  },
  {
    name: 'ห้องย้อมพิเศษ',
    work: [ 'ตัด Add', 'ย้อมพิเศษ', 'ล้าง+set น้ำยา' ],
  },
  {
    name: 'ห้องอิมมูโน',
    work: [ 'ย้อม IHC', 'FISH' ],
  },
  {
    name: 'ห้อง Cyto',
    work: ['รับ Cyto + Screening'],
  },
  {
    name: 'ห้องรายงาน',
    work: [ 'พิมพ์รายงาน', 'พิมพ์รายงาน + ลงย้อมเพิ่ม', 'สแกนใบส่งตรวจ'],
  },
  {
    name: 'ห้องเก็บบล็อก / สไลด์',
    work: ['เก็บบล็อก / สไลด์'],
  },
  {
    name: 'ห้อง DDM',
    work: ['สแกนไลด์'],
  },
  {
    name: 'ห้องศพ',
    work: [],
  },
  {
    name: 'ห้อง Muscle / Nerve',
    work: [],
  },
  {
    name: 'ห้องโฟลไซโตเมทรี',
    work: [],
  },
]
