export const roomList = [
  {
    name: 'ห้องรับสิ่งส่งตรวจ',
    work: [
      'รับสิ่งส่งตรวจลงทะเบียนสิ่งส่งตรวจ',
      'รับสิ่งส่งตรวจคลินิกและคลินิกพิเศษ',
    ],
    rate: [130],
  },
  {
    name: 'ห้องตรวจชิ้นเนื้อทางพยาธิวิทยา',
    work: ['ตรวจชิ้นเนื้อด้วยตาเปล่าทางพยาธิวิทยา'],
    rate: [150],
  },
  {
    name: 'ห้องจุลพยาธิวิทยาพื้นฐาน / ห้อง Routine',
    work: [
      'Embed เนื้อเช้า',
      'Section เนื้อเช้า',
      'Embed และ Section',
      'Embed, Section และเปลี่ยนน้ำยา',
      'Embed, Section และเก็บเนื้อ process',
      'Embed, Section และตรวจสอบคุณภาพสไลด์',
      'เก็บเนื้อ process',
      'พนักงานห้องทดลอง',
    ],
    rate: [ 150, 110 ],
  },
  {
    name: 'ห้องฮีสโตเคมี',
    work: [
      'เตรียมสไลด์ย้อมพิเศษ',
      'เตรียมสไลด์ย้อมพิเศษ และทำ frozen',
      'ตัดสไลด์ additional',
      'ย้อมสไลด์ special stain',
      'ย้อมสไลด์ special stain และล้างเซตน้ำยา'
    ],
    rate: [150],
  },
  {
    name: 'ห้องอิมมูโนพยาธิวิทยา',
    work: [ 'ย้อม IHC', 'FISH' ],
    rate: [150],
  },
  {
    name: 'ห้องเซลล์วิทยา',
    work: ['จัดการสิ่งส่งตรวจทางเซลล์วิทยา'],
    rate: [150],
  },
  {
    name: 'ห้องรายงานผล',
    work: [ 'พิมพ์รายงานผล', 'พิมพ์รายงานผล และคิดราคาย้อมเพิ่ม', 'สแกนใบส่งตรวจ'],
    rate: [ 60, 65, 110 ],
  },
  {
    name: 'ห้องเก็บบล็อก / สไลด์',
    work: ['เก็บบล็อก / สไลด์'],
    rate: ['N/A'],
  },
  {
    name: 'หน่วยดิจิทัล และการจัดการข้อมูล',
    work: ['สแกนไลด์'],
    rate: [130],
  },
  {
    name: 'ห้องศพ',
    work: [],
    rate: ['N/A'],
  },
  {
    name: 'ห้องอณูพยาธิวิทยา',
    work: [],
    rate: ['N/A'],
  },
  {
    name: 'ห้อง Muscle / Nerve',
    work: [],
    rate: [150],
  },
  {
    name: 'ห้องโฟลไซโตเมทรี',
    work: [],
    rate: [150],
  },
]

export const personPerRoom = {
  weekday: [2, 1, 7, 1, 2, 0, 4, 0, 0, 2, 0, 0, 1],
  weekend: [2, 2, 8, 3, 2, 1, 3, 2, 1, 1, 0, 1, 0],
}
