export const roomList: {
  name: string;
  work: [string, number][];
}[] = [
  {
    name: 'ห้องรับสิ่งส่งตรวจ',
    work: [['รับสิ่งส่งตรวจ', 130]],
  },
  {
    name: 'ห้องตรวจชิ้นเนื้อทางพยาธิวิทยา',
    work: [['ตรวจชิ้นเนื้อด้วยตาเปล่าทางพยาธิวิทยา', 150]],
  },
  {
    name: 'ห้องจุลพยาธิวิทยาพื้นฐาน',
    work: [
      ['Embed', 150],
      ['Section', 150],
      ['เปลี่ยนน้ำยา', 150],
      ['ตรวจสอบคุณภาพสไลด์', 150],
      ['เก็บเนื้อ process', 150],
      ['พนักงานห้องทดลอง', 110],
    ],
  },
  {
    name: 'ห้องเก็บบล็อกสไลด์',
    work: [['เก็บบล็อกสไลด์', 110]],
  },
  {
    name: 'งาน additional',
    work: [['ตัดสไลด์ additional', 150]],
  },
  {
    name: 'ห้องฮีสโตเคมี',
    work: [
      ['เตรียมสไลด์ย้อมพิเศษ', 150],
      ['ทำ frozen', 150],
      ['ย้อมสไลด์ special stain', 150],
      ['ล้างเซตน้ำยา special stain', 150],
    ],
  },
  {
    name: 'ห้องอิมมูโนฯ',
    work: [['ย้อมสไลด์ immuno stain', 150]],
  },
  {
    name: 'ห้องเซลล์วิทยา',
    work: [['จัดการสิ่งส่งตรวจทางเซลล์วิทยา', 150]],
  },
  {
    name: 'DDM',
    work: [['สแกนไลด์', 130]],
  },
  {
    name: 'ห้องรายงาน',
    work: [
      ['พิมพ์รายงานผล', 60],
      ['สแกนใบส่งตรวจ', 60],
      ['พิมพ์รายงานผล และคิดราคาย้อมเพิ่ม', 110],
    ],
  },
  {
    name: 'ห้องศพ',
    work: [['ตรวจและบริการเกี่ยวกับศพ', 60]],
  },
  {
    name: 'ห้องอณูพยาธิวิทยา',
    work: [['ห้องอณูพยาธิวิทยา', 150]],
  },
  {
    name: 'ห้องโฟลไซโตเมทรี',
    work: [['ห้องโฟลไซโตเมทรี', 150]],
  },
  {
    name: 'ห้องจุลทรรศน์อิเล็กตรอน',
    work: [['ห้องจุลทรรศน์อิเล็กตรอน', 150]],
  },
  {
    name: 'ห้องตรวจกล้ามเนื้อและเส้นประสาท',
    work: [['ห้องตรวจกล้ามเนื้อและเส้นประสาท', 150]],
  },
  {
    name: 'คนงาน',
    work: [
      ['60', 60],
      ['65', 65],
    ],
  },
  {
    name: 'สำนักงานภาควิชาฯ',
    work: [
      ['60', 60],
      ['65', 65],
      ['110', 110],
    ],
  }
]

export const personPerRoom = {
  weekday: [1, 2, 8, 1, 1, 2, 1, 1, 1, 5, 2, 1, 2, 1, 2, 5, 15],
  weekend: [1, 3, 9, 3, 1, 3, 3, 1, 2, 4, 2, 1, 2, 1, 2, 5, 15],
}
